In [1]:
import numpy as np
import pandas as pd

In [2]:
#create series
s = pd.Series([1,3,5,np.nan,6,8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101",periods=6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
#Create Data Frame
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
print(df)

                   A         B         C         D
2013-01-01 -0.178434 -0.837065  0.264520  0.061243
2013-01-02  1.899566  1.067652 -0.688500  1.023190
2013-01-03 -0.683247 -0.144321  0.567300  1.283795
2013-01-04  0.214107 -0.022313  0.015231 -1.116062
2013-01-05 -0.728666  0.761278 -0.784937 -0.546256
2013-01-06  0.989258  1.916193  0.076924 -0.633881

In [5]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [6]:
#Display above above, below rows and index for above data frame
df2 = pd.DataFrame({ 'A' : 1.,
                              'B' : pd.Timestamp('20130102'),
                              'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                              'D' : np.array([3] * 4,dtype='int32'),
                              'E' : pd.Categorical(["test","train","test","train"]),
                              'F' : 'foo' }
                  )
print(df2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.252097  0.456904 -0.091577  0.012005
std    1.027728  0.985967  0.536244  0.963715
min   -0.728666 -0.837065 -0.784937 -1.116062
25%   -0.557044 -0.113819 -0.512567 -0.611974
50%    0.017836  0.369483  0.046077 -0.242506
75%    0.795470  0.991059  0.217621  0.782703
max    1.899566  1.916193  0.567300  1.283795

In [9]:
df.head()

                   A         B         C         D
2013-01-01 -0.178434 -0.837065  0.264520  0.061243
2013-01-02  1.899566  1.067652 -0.688500  1.023190
2013-01-03 -0.683247 -0.144321  0.567300  1.283795
2013-01-04  0.214107 -0.022313  0.015231 -1.116062
2013-01-05 -0.728666  0.761278 -0.784937 -0.546256

In [10]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.214107 -0.022313  0.015231 -1.116062
2013-01-05 -0.728666  0.761278 -0.784937 -0.546256
2013-01-06  0.989258  1.916193  0.076924 -0.633881

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.to_numpy()

array([[-0.17843417, -0.83706534,  0.26451986,  0.06124267],
       [ 1.89956632,  1.06765245, -0.68850007,  1.02319001],
       [-0.68324703, -0.14432071,  0.56730022,  1.28379535],
       [ 0.21410677, -0.02231253,  0.01523064, -1.11606236],
       [-0.72866622,  0.76127816, -0.78493715, -0.54625558],
       [ 0.98925802,  1.91619347,  0.07692414, -0.63388079]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
# Describe the data frame
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.252097  0.456904 -0.091577  0.012005
std    1.027728  0.985967  0.536244  0.963715
min   -0.728666 -0.837065 -0.784937 -1.116062
25%   -0.557044 -0.113819 -0.512567 -0.611974
50%    0.017836  0.369483  0.046077 -0.242506
75%    0.795470  0.991059  0.217621  0.782703
max    1.899566  1.916193  0.567300  1.283795

In [15]:
#Find Transpose of above data frame
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.178434    1.899566   -0.683247    0.214107   -0.728666    0.989258
B   -0.837065    1.067652   -0.144321   -0.022313    0.761278    1.916193
C    0.264520   -0.688500    0.567300    0.015231   -0.784937    0.076924
D    0.061243    1.023190    1.283795   -1.116062   -0.546256   -0.633881

In [16]:
# Sort row ‘B’
df.sort_values(by="B")

                   A         B         C         D
2013-01-01 -0.178434 -0.837065  0.264520  0.061243
2013-01-03 -0.683247 -0.144321  0.567300  1.283795
2013-01-04  0.214107 -0.022313  0.015231 -1.116062
2013-01-05 -0.728666  0.761278 -0.784937 -0.546256
2013-01-02  1.899566  1.067652 -0.688500  1.023190
2013-01-06  0.989258  1.916193  0.076924 -0.633881

In [17]:
#Display row ‘A’.
df["A"]

2013-01-01   -0.178434
2013-01-02    1.899566
2013-01-03   -0.683247
2013-01-04    0.214107
2013-01-05   -0.728666
2013-01-06    0.989258
Freq: D, Name: A, dtype: float64

In [18]:
#Display First three rows.
df[0:3]

                   A         B        C         D
2013-01-01 -0.178434 -0.837065  0.26452  0.061243
2013-01-02  1.899566  1.067652 -0.68850  1.023190
2013-01-03 -0.683247 -0.144321  0.56730  1.283795

In [19]:
df.loc[dates[0]]

A   -0.178434
B   -0.837065
C    0.264520
D    0.061243
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
df.loc["20130102",["A","B"]]

A    1.899566
B    1.067652
Name: 2013-01-02 00:00:00, dtype: float64

In [21]:
df.iloc[3]

A    0.214107
B   -0.022313
C    0.015231
D   -1.116062
Name: 2013-01-04 00:00:00, dtype: float64

In [22]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.899566 -0.688500
2013-01-03 -0.683247  0.567300
2013-01-05 -0.728666 -0.784937

In [23]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.837065  0.264520
2013-01-02  1.067652 -0.688500
2013-01-03 -0.144321  0.567300
2013-01-04 -0.022313  0.015231
2013-01-05  0.761278 -0.784937
2013-01-06  1.916193  0.076924

In [24]:
df[df["A"]>0]

                   A         B         C         D
2013-01-02  1.899566  1.067652 -0.688500  1.023190
2013-01-04  0.214107 -0.022313  0.015231 -1.116062
2013-01-06  0.989258  1.916193  0.076924 -0.633881

In [25]:
#Create a series with index.
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
print(s1)

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [26]:
df.at[dates[0],"A"]=0

In [27]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [28]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [29]:
print(df1)

                   A         B         C         D    E
2013-01-01  0.000000 -0.837065  0.264520  0.061243  1.0
2013-01-02  1.899566  1.067652 -0.688500  1.023190  1.0
2013-01-03 -0.683247 -0.144321  0.567300  1.283795  NaN
2013-01-04  0.214107 -0.022313  0.015231 -1.116062  NaN

In [30]:
df1.dropna(how='any')

                   A         B        C         D    E
2013-01-01  0.000000 -0.837065  0.26452  0.061243  1.0
2013-01-02  1.899566  1.067652 -0.68850  1.023190  1.0

In [31]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.000000 -0.837065  0.264520  0.061243  1.0
2013-01-02  1.899566  1.067652 -0.688500  1.023190  1.0
2013-01-03 -0.683247 -0.144321  0.567300  1.283795  5.0
2013-01-04  0.214107 -0.022313  0.015231 -1.116062  5.0

In [32]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [33]:
df.mean()

A    0.281836
B    0.456904
C   -0.091577
D    0.012005
dtype: float64

In [34]:
df.mean(1)

2013-01-01   -0.127826
2013-01-02    0.825477
2013-01-03    0.255882
2013-01-04   -0.227259
2013-01-05   -0.324645
2013-01-06    0.587124
Freq: D, dtype: float64

In [35]:
#Fill null value of a above data frame.
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
print(s)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [36]:
#Find out the combined SUM of the above Dataframe
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.000000 -0.837065  0.264520  0.061243
2013-01-02  1.899566  0.230587 -0.423980  1.084433
2013-01-03  1.216319  0.086266  0.143320  2.368228
2013-01-04  1.430426  0.063954  0.158551  1.252166
2013-01-05  0.701760  0.825232 -0.626386  0.705910
2013-01-06  1.691018  2.741426 -0.549462  0.072029

In [37]:
s = pd.Series(np.random.randint(0, 7, size=10))
print(s)

0    5
1    4
2    1
3    2
4    1
5    6
6    0
7    1
8    6
9    4
dtype: int32

In [38]:
s.value_counts()

1    3
4    2
6    2
0    1
2    1
5    1
dtype: int64

In [39]:
#Create a series with Categorical data
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [40]:
#Sort the above series in descending Order.
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [41]:
df = pd.DataFrame(np.random.randn(10, 4))

In [42]:
print(df)

          0         1         2         3
0 -0.722028  1.160172 -1.477345 -0.145946
1  0.034255 -0.095289  0.380699  1.115075
2  0.545098 -0.447476  0.035316 -1.003219
3 -1.120143  0.362509 -1.386988 -0.015665
4 -1.412409  1.506244 -0.902790  0.533334
5  0.518221  1.150669  1.100615  1.458690
6  0.381271  1.805314 -1.528889  0.024303
7 -1.580385 -0.950966 -0.504852 -0.429404
8  0.641828  2.007716  0.025286 -0.460139
9  1.034640  0.869623  0.482510 -2.541166

In [43]:
#Create two Data frames and merge them
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [44]:
print(right)

   key  rval
0  foo     4
1  foo     5

In [45]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [46]:
#Present some raw of data frame with groupby
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [47]:
print(df)

     A      B         C         D
0  foo    one  0.472132 -1.013251
1  bar    one -1.509009 -0.300569
2  foo    two  1.621772 -0.110288
3  bar  three  0.325338 -0.858223
4  foo    two -0.453000 -0.476188
5  bar    two  0.115797 -0.725625
6  foo    one  0.593258  0.526275
7  foo  three -0.352552  0.825150

In [48]:
df.groupby('A').sum()

            C         D
A
bar -1.067874 -1.884417
foo  1.881609 -0.248302

In [49]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))

In [50]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [51]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [52]:
df2 = df[:4]

In [53]:
print(df2)

                     A         B
first second
bar   one     0.692883 -1.652245
      two    -0.449403 -0.560069
baz   one     0.154296 -0.798463
      two    -0.694636 -0.089311

In [54]:
stacked = df2.stack()
print(stacked)

first  second
bar    one     A    0.692883
               B   -1.652245
       two     A   -0.449403
               B   -0.560069
baz    one     A    0.154296
               B   -0.798463
       two     A   -0.694636
               B   -0.089311
dtype: float64

In [55]:
df.describe()

              A         B
count  8.000000  8.000000
mean  -0.214839 -0.527054
std    0.724048  0.666362
min   -0.941007 -1.652245
25%   -0.733390 -0.858366
50%   -0.515770 -0.558664
75%    0.288942 -0.072919
max    0.950947  0.502733